# Курс: AI+Python
# Модуль 14. Серверне програмування
# Тема: Docker. Частина 1
#
#   Завдання 2
# Для сервера про книги з минулого заняття
# Збережіть усі необхідні бібліотеки
# pip freeze > requirements.txt

# Створіть Dockerfile:
# ● python:3.11-slim
# ● робоча директорія – /app
# ● встановіть потрібні бібліотеки
# ● скопіюйте увесь код
# ● запустіть основний файл

# Створіть образ та контейнер
# Напишіть клієнта який робить запити на сервер
# Виведіть логи контейнера
# Спробуйте запустити другий контейнер

import uvicorn

if __name__ == "__main__":
    uvicorn.run(
        app = "application:app",
        host = "0.0.0.0",
        port = 8080,
)
