# Курс: AI+Python
# Модуль 8. Файли. Винятки
# Тема: Винятки. Частина 1

#    ЗАВДАННЯ 1
# Напишіть функцію, яка запитує користувача пароль та повертає його.
# Якщо пароль поганий, тобто менше 8 символів чи містить однакові символи то викликати виняток ValueError.
# Написати код try … except який використовує дану функцію.

def parol ():


#   ЗАВДАННЯ 2
# Є словник де ключ – логін, а значення – пароль.
# Напишіть функцію, яка запитує користувача логін та пароль.
# Якщо логіна немає в словнику, або невірний пароль, то викликати ValueError.
# Написати код try … except який використовує дану функцію.