# ----- ІСПИТ -----
# 1
# Курс: «AI + Python
# Підведення підсумків. Іспит

# Частина 1: Основи Python
# --- 1. Напишіть програму, яка приймає два цілих числа від користувача і виводить суму діапазону чисел між ними.
print("ПРОГРАМА, яка приймає два цілих числа і виводить суму діапазону між ними")

number_1 = int(input("Введіть ціле 1-ше число: "))
number_2 = int(input("Введіть ціле 2-ге число: "))

sum_number = 0

for i in range(number_1, number_2 + 1):
    sum_number += i

print(f"Сума діапазону чисел між {number_1} та {number_2} =", sum_number)

# --- 2. Напишіть програму, для знаходження суми всіх парних чисел від 1 до 100.
print("\nПРОГРАМА, яка знаходить всі прані числа від 1 до 100")

for i in range(2, 101, 2):
    print("Парні числа від 1 до 100 включно: ", i)

# --- 3. Напишіть програму, яка приймає рядок від користувача і виводить кожну літеру рядка на окремому рядку.
print("\nПРОГРАМА, яка виводить кожну літеру в окремому рядку")

text = input("Введіть якийсь текст: ")

for char in text:
    print(char)

# --- 4. Напишіть програму, яка створює список цілих чисел та виводить новий список,
# який містить лише парні числа з вихідного списку.
print("\nПРОГРАМА, яка виводить список з парними числами")

list_numbers = [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

even_numbers = []

for number in list_numbers:
    if number % 2 == 0:
        even_numbers.append(number)

print("Вихідний список: ", *list_numbers)
print("НОВИЙ список з парними числами: ", *even_numbers)

# --- 5. Напишіть функцію, яка приймає список рядків від користувача і повертає новий список,
# що містить лише рядки, що починаються з великої літери.
print("\nФУНКЦІЯ, яка повертає введений список з рядками, що починаються з великої літери")

def words_big_letter(words):
    word_list = []

    for word in words:
        if word[0].isupper():
            word_list.append(word)

    return word_list

user_list = input("Введіть кілька різних слів або речень: ").split()

new_list = words_big_letter(user_list)

print("Список слів, що починаються з великої літери:", new_list)

# 6. Напишіть функцію, яка приймає список рядків від користувача і повертає новий список,
# що містить лише рядки, які містять слово "Python".
print("\nФУНКЦІЯ, яка повертає рядками, які містять слово 'Python' ")

def word_test_python(words):
    python_words = []

    for word in words:
        if "Python" in word:
            python_words.append(word)

    return python_words

user_list = input("Введіть рядки : ").split(",")

python_list = word_test_python(user_list)

print("Рядки, які містять слово 'Python':", new_list)

# 7. (додаткове на кристалики)
# Напишіть програму, яка створює словник, де ключами є слова, а значеннями - їхні визначення.
# Дозвольте користувачу додавати, видаляти та шукати слова у цьому словнику.
print("\nПРОГРАМА - словник із функціоналом додавання, видалення та пошуку слів")

my_dictionary = {}

while True:
    print("\n1. Додати слово"
            "2. Видалити слово"
            "3. Знайти слово"
            "4. Вихід")
    choice = input("Оберіть варіанти (1-4): ")

    if choice == "1":
        word = input("Введіть нове слово: ")
        definition = input("Введіть визначення (значення) цього слова: ")

        my_dictionary[word] = definition
        print(f"Слово '{word}' успішно додано!")

    elif choice == "2":
        word_to_delete = input("Яке слово ви хочете видалити? ")

        # Перевіряємо, чи є взагалі таке слово в словнику
        if word_to_delete in my_dictionary:
            my_dictionary.pop(word_to_delete)  # Видаляємо слово
            print(f"Слово '{word_to_delete}' видалено.")
        else:
            print("Такого слова немає в словнику!")

    elif choice == "3":
        search_word = input("Яке слово ви шукаєте? ")

        # Перевіряємо, чи є слово у словнику
        if search_word in my_dictionary:
            # Виводимо його значення
            print(f"Значення слова '{search_word}': {my_dictionary[search_word]}")
        else:
            print("Такого слова не знайдено.")

    elif choice == "4":
        print("Програму завершено!")
        break
    else:
        print("Неправильний вибір, спробуйте ще раз.")

# 8. (додаткове на кристалики)
# Використовуючи лямбдафункцію, напишіть вираз, який сортує список кортежів
# за другим елементом кожного кортежу (наприклад, [(1, 3), (3, 2), (2, 1)]).


# Частина 2: Об'єктно-орієнтоване програмування (ООП)

# Симулятор роботи сайту
# WebSite: Основний клас, який представляє вебсайт.
# Атрибути: назва сайту, URL, список сторінок.
# Методи: додавання/видалення сторінок, відображення інформації про сайт.
# WebPage: Клас, який представляє окрему сторінку на сайті.
# Атрибути: заголовок сторінки, вміст, дата публікації.
# Методи: відображення деталей сторінки.

# Реалізація функціональності:
# Дозвольте користувачеві створювати новий сайт з певною назвою та URL.
# Додайте можливість створювати нові сторінки для сайту, вводячи заголовок та вміст.
# Реалізуйте функцію для видалення сторінок з сайту.
# Включіть функцію для відображення всієї інформації про сайт, включаючи список усіх сторінок.
# Розробіть простий текстовий інтерфейс для взаємодії з користувачем.
# Користувач повинен мати змогу вибирати дії, такі як створення сайту, додавання/видалення сторінок,
# перегляд інформації про сайт.

print("СИМУЛЯТОР РОБОТИ САЙТУ")

# 1. Створюємо КЛАС для СТОРІНКИ
class WebPage:
    def __init__(self, title, content):
        self.title = title      # Назва сторінки
        self.content = content  # Текст на сторінці

    def display_details(self):
        print(f"Сторінка: {self.title} | Текст: {self.content}")


# 2. Створюємо КЛАС для САЙТУ
class WebSite:
    def __init__(self, name, url):
        self.name = name
        self.url = url
        self.pages = []  # Список, де будуть знаходитись сторінки

    def add_page(self, page):
        # Додаємо сторінку в список
        self.pages.append(page)
        print("Сторінку успішно додано!")

    def remove_page(self, title_to_remove):
        # Шукаємо сторінку в списку за назвою
        for page in self.pages:
            if page.title == title_to_remove:
                self.pages.remove(page)  # Видаляємо сторінку
                print("Сторінку видалено.")
                return
        print("Такої сторінки не знайдено.")

    def display_info(self):
        print(f"\nСайт: {self.name} ({self.url})")
        print("Список усіх сторінок:")
        for page in self.pages:
            print(f"- {page.title}")


# 3. ВІДТВОРЮЄМО Текстове меню (взаємодія між класами)
name = input("Введіть назву сайту: ")
url = input("Введіть URL сайту: ")
my_site = WebSite(name, url)

while True:
    print("\n1. Додати сторінку "
            "2. Видалити сторінку "
            "3. Інфо про сайт"
            "4. Вихід")
    choice = input("Оберіть дію (1-4): ")

    if choice == "1":
        title = input("Введіть назву сторінки: ")
        content = input("Введіть текст сторінки: ")
        new_page = WebPage(title, content)  # Створюємо сторінку
        my_site.add_page(new_page)          # Додаємо її на сайт

    elif choice == "2":
        title_to_delete = input("Яку сторінку видалити? ")
        my_site.remove_page(title_to_delete)

    elif choice == "3":
        my_site.display_info()

    elif choice == "4":
        print("Програму завершено!")
        break

# Додаткові можливості (за бажанням на кристалики):
# Реалізуйте систему логіну/реєстрації для керування
# сайтом. Додайте можливість редагування існуючих сторінок.
# Створіть функціонал для пошуку сторінок за ключовими
# словами у заголовку або вмісті.
