# Курс: AI+Python
# Модуль 14. Серверне програмування
# Тема: Docker. Частина 1

#   ЗАВДАННЯ 1
# Для сервера про фільми з минулого заняття
# Збережіть усі необхідні бібліотеки
# pip freeze > requirements.txt

# Створіть Dockerfile:
# ● python:3.11-slim
# ● робоча директорія – /app
# ● встановіть потрібні бібліотеки
# ● скопіюйте увесь код
# ● запустіть основний файл
# Створіть образ та контейнер
# Скористайтесь кодом клієнта з попереднього дз
# Виведіть логи контейнера

import uvicorn

if __name__ == "__main__":
    uvicorn.run(
        app = "application_film:app",
        host = "0.0.0.0",
        port = 8080,
)
