-- Курс: «Введення в мову
-- програмування Python
-- Модуль 15. Вступ до теорії баз даних
-- Тема: Вступ до теорії баз даних.
-- Частина 4/1
-- Виконайте запити цього домашнього завдання до бази даних Академія (Academy).
-- Опис бази даних знаходиться в кінці файлу.

-- Таблиці
-- Нижче наведено детальний опис структури кожної таблиці.

-- ¾ КУРАТОРИ (CURATORS)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор куратора.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Ім’я (Name). Ім’я куратора.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожнє.
-- ■ Прізвище (Surname). Прізвище куратора.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожнє.
	-- CREATE TABLE CURATORS (

	-- ID SERIAL PRIMARY KEY,

	-- NAME VARCHAR(100) NOT NULL
	-- 	CHECK (NAME <> ''),

	-- SURNAME VARCHAR(100) NOT NULL
	-- 	CHECK (SURNAME <> '')
	-- )

	-- INSERT INTO CURATORS (NAME, SURNAME)
	-- VALUES
	-- ('Іван', 'Петренко'),
	-- ('Олександр', 'Шевченко'),
	-- ('Максим', 'Бондаренко'),
	-- ('Андрій', 'Коваленко'),
	-- ('Дмитро', 'Ткаченко'),
	-- ('Володимир', 'Мельник'),
	-- ('Сергій', 'Кравченко'),
	-- ('Юрій', 'Олійник'),
	-- ('Віталій', 'Савченко'),
	-- ('Микола', 'Романенко'),
	-- ('Олег', 'Лисенко'),
	-- ('Богдан', 'Гриценко'),
	-- ('Євген', 'Марченко'),
	-- ('Роман', 'Поліщук'),
	-- ('Тарас', 'Данилюк'),
	-- ('Павло', 'Іщенко'),
	-- ('Артем', 'Сидоренко'),
	-- ('Руслан', 'Чумак'),
	-- ('Василь', 'Яремчук'),
	-- ('Степан', 'Захаренко'),
	-- ('Анна', 'Коваль'),
	-- ('Марія', 'Білик'),
	-- ('Олена', 'Назаренко'),
	-- ('Ірина', 'Левченко'),
	-- ('Катерина', 'Паламарчук'),
	-- ('Наталія', 'Федоренко'),
	-- ('Юлія', 'Мороз'),
	-- ('Тетяна', 'Кушнір'),
	-- ('Світлана', 'Дорошенко'),
	-- ('Вікторія', 'Приходько');

-- ¾ КАФЕДРИ (DEPARTMENTS)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор кафедри.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Фінансування (Financing). Фонд фінансування кафедри.
-- ▷ Тип даних — DECIMAL(10, 2).
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 0.
-- ▷ Значення за замовчуванням — 0.
-- ■ Назва (Name). Назва кафедри.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.
-- ■ Ідентифікатор факультету (FacultyId). Факультет, до складу якого належить кафедра.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
	-- CREATE TABLE DEPARTMENTS (

	-- ID SERIAL PRIMARY KEY,

	-- FINANCING DECIMAL(10, 2) NOT NULL
	-- 	CHECK (FINANCING >= 0)
	-- 	DEFAULT 0,

	-- NAME VARCHAR(100) NOT NULL
	-- 	CHECK (NAME <> '')
	-- 	UNIQUE,

	-- FACULTY_ID INT NOT NULL,
	-- 	FOREIGN KEY (FACULTY_ID)
	-- 		REFERENCES FACULTIES(ID)
	-- )

	-- INSERT INTO DEPARTMENTS (FINANCING, NAME, FACULTY_ID)
	-- VALUES
	-- (250000.00, 'Кафедра програмування', 1),
	-- (220000.00, 'Кафедра Data Science', 1),
	-- (210000.00, 'Кафедра штучного інтелекту', 1),

	-- (300000.00, 'Кафедра кіберзахисту', 2),
	-- (180000.00, 'Кафедра мережевої безпеки', 2),

	-- (260000.00, 'Кафедра вебтехнологій', 3),
	-- (240000.00, 'Кафедра системного аналізу', 3),

	-- (190000.00, 'Кафедра прикладної математики', 4),
	-- (170000.00, 'Кафедра математичного моделювання', 4),

	-- (200000.00, 'Кафедра теоретичної фізики', 5),
	-- (160000.00, 'Кафедра ядерної фізики', 5),

	-- (210000.00, 'Кафедра органічної хімії', 6),
	-- (180000.00, 'Кафедра неорганічної хімії', 6),

	-- (175000.00, 'Кафедра генетики', 7),
	-- (165000.00, 'Кафедра мікробіології', 7),

	-- (350000.00, 'Кафедра хірургії', 8),
	-- (340000.00, 'Кафедра терапії', 8),
	-- (320000.00, 'Кафедра анатомії', 8),

	-- (270000.00, 'Кафедра стоматології', 9),
	-- (230000.00, 'Кафедра ортодонтії', 9),

	-- (190000.00, 'Кафедра фармакології', 10),
	-- (180000.00, 'Кафедра клінічної фармації', 10),

	-- (150000.00, 'Кафедра макроекономіки', 11),
	-- (145000.00, 'Кафедра мікроекономіки', 11),

	-- (170000.00, 'Кафедра банківської справи', 12),
	-- (165000.00, 'Кафедра бухгалтерського обліку', 12),

	-- (160000.00, 'Кафедра стратегічного менеджменту', 13),
	-- (150000.00, 'Кафедра управління персоналом', 13),

	-- (140000.00, 'Кафедра цифрового маркетингу', 14),
	-- (135000.00, 'Кафедра реклами та PR', 14),

	-- (155000.00, 'Кафедра дипломатії', 15),
	-- (145000.00, 'Кафедра міжнародного права', 15),

	-- (180000.00, 'Кафедра кримінального права', 16),
	-- (175000.00, 'Кафедра цивільного права', 16),

	-- (120000.00, 'Кафедра журналістики', 17),
	-- (115000.00, 'Кафедра медіакомунікацій', 17),

	-- (110000.00, 'Кафедра української філології', 18),
	-- (105000.00, 'Кафедра зарубіжної літератури', 18),

	-- (125000.00, 'Кафедра англійської мови', 19),
	-- (120000.00, 'Кафедра німецької мови', 19),

	-- (100000.00, 'Кафедра історії України', 20),
	-- (98000.00, 'Кафедра всесвітньої історії', 20),

	-- (95000.00, 'Кафедра філософії', 21),
	-- (93000.00, 'Кафедра етики та естетики', 21),

	-- (102000.00, 'Кафедра соціології', 22),
	-- (99000.00, 'Кафедра соціальних досліджень', 22),

	-- (130000.00, 'Кафедра психології', 23),
	-- (125000.00, 'Кафедра практичної психології', 23),

	-- (220000.00, 'Кафедра архітектурного дизайну', 24),
	-- (210000.00, 'Кафедра урбаністики', 24),

	-- (240000.00, 'Кафедра будівельних конструкцій', 25),
	-- (230000.00, 'Кафедра інженерної механіки', 25),

	-- (280000.00, 'Кафедра електроенергетики', 26),
	-- (260000.00, 'Кафедра електротехніки', 26),

	-- (290000.00, 'Кафедра машинобудування', 27),
	-- (250000.00, 'Кафедра автоматизації виробництва', 27),

	-- (200000.00, 'Кафедра агрономії', 28),
	-- (190000.00, 'Кафедра агроінженерії', 28),

	-- (210000.00, 'Кафедра ветеринарії', 29),
	-- (180000.00, 'Кафедра ветеринарної хірургії', 29),

	-- (150000.00, 'Кафедра графічного дизайну', 30),
	-- (145000.00, 'Кафедра промислового дизайну', 30);

-- ¾ ФАКУЛЬТЕТИ (FACULTIES)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор факультету.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Фінансування (Financing). Фонд фінансування факультету.
-- ▷ Тип даних — DECIMAL(10, 2).
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 0.
-- ▷ Значення за замовчуванням — 0.
-- ■ Назва (Name). Назва факультету.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.
	-- CREATE TABLE FACULTIES (

	-- ID SERIAL PRIMARY KEY,

	-- FINANCING DECIMAL(10, 2) NOT NULL
	-- 	CHECK (FINANCING >= 0)
	-- 	DEFAULT 0,

	-- NAME VARCHAR (100) NOT NULL
	-- 	CHECK (NAME <> '')
	-- 	UNIQUE
	-- )

	-- INSERT INTO FACULTIES (FINANCING, NAME)
	-- VALUES
	-- (1250000.00, 'Факультет компютерних наук'),
	-- (980000.00, 'Факультет кібербезпеки'),
	-- (870000.00, 'Факультет інформаційних технологій'),
	-- (760000.00, 'Факультет прикладної математики'),
	-- (640000.00, 'Факультет фізики'),
	-- (710000.00, 'Факультет хімії'),
	-- (590000.00, 'Факультет біології'),
	-- (830000.00, 'Факультет медицини'),
	-- (910000.00, 'Факультет стоматології'),
	-- (550000.00, 'Факультет фармацевтики'),
	-- (470000.00, 'Факультет економіки'),
	-- (520000.00, 'Факультет фінансів'),
	-- (480000.00, 'Факультет менеджменту'),
	-- (430000.00, 'Факультет маркетингу'),
	-- (390000.00, 'Факультет міжнародних відносин'),
	-- (410000.00, 'Факультет права'),
	-- (360000.00, 'Факультет журналістики'),
	-- (340000.00, 'Факультет філології'),
	-- (370000.00, 'Факультет іноземних мов'),
	-- (300000.00, 'Факультет історії'),
	-- (280000.00, 'Факультет філософії'),
	-- (295000.00, 'Факультет соціології'),
	-- (315000.00, 'Факультет психології'),
	-- (450000.00, 'Факультет архітектури'),
	-- (510000.00, 'Факультет будівництва'),
	-- (620000.00, 'Факультет електроенергетики'),
	-- (670000.00, 'Факультет машинобудування'),
	-- (540000.00, 'Факультет агротехнологій'),
	-- (460000.00, 'Факультет ветеринарної медицини'),
	-- (350000.00, 'Факультет дизайну');

-- ¾ ГРУПИ (GROUPS)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор групи.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Назва (Name). Назва групи.
-- ▷ Тип даних — varchar(10).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.
-- ■ Курс (Year). Курс (рік), на якому навчається група.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Має бути в діапазоні від 1 до 5.
-- ■ Ідентифікатор кафедри (DepartmentId). Кафедра, до складу якої належить група.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
	-- CREATE TABLE GROUPS (

	-- ID SERIAL PRIMARY KEY,

	-- NAME VARCHAR(10) NOT NULL
	-- 	CHECK (NAME <> '')
	-- 	UNIQUE,

	-- YEAR INT NOT NULL
	-- 	CHECK (YEAR BETWEEN 1 AND 5),

	-- DEPARTMENT_ID INT NOT NULL,
	-- 	FOREIGN KEY (DEPARTMENT_ID)
	-- 		REFERENCES DEPARTMENTS(ID)
	-- )

	-- INSERT INTO GROUPS (NAME, YEAR, DEPARTMENT_ID)
	-- VALUES
	-- ('CS-101', 1, 1),
	-- ('CS-102', 1, 1),
	-- ('CS-201', 2, 1),
	-- ('CS-301', 3, 1),

	-- ('DS-101', 1, 2),
	-- ('DS-201', 2, 2),
	-- ('DS-301', 3, 2),

	-- ('AI-101', 1, 3),
	-- ('AI-201', 2, 3),
	-- ('AI-401', 4, 3),

	-- ('CYB-101', 1, 4),
	-- ('CYB-201', 2, 4),
	-- ('CYB-301', 3, 4),

	-- ('NET-101', 1, 5),
	-- ('NET-202', 2, 5),

	-- ('WEB-101', 1, 6),
	-- ('WEB-201', 2, 6),
	-- ('WEB-301', 3, 6),

	-- ('SYS-101', 1, 7),
	-- ('SYS-401', 4, 7),

	-- ('MAT-101', 1, 8),
	-- ('MAT-201', 2, 8),
	-- ('MAT-301', 3, 8),

	-- ('MOD-101', 1, 9),
	-- ('MOD-501', 5, 9),

	-- ('PHY-101', 1, 10),
	-- ('PHY-201', 2, 10),

	-- ('NUC-101', 1, 11),
	-- ('NUC-401', 4, 11),

	-- ('ORG-101', 1, 12),
	-- ('ORG-201', 2, 12),

	-- ('CHE-101', 1, 13),
	-- ('CHE-301', 3, 13),

	-- ('GEN-101', 1, 14),
	-- ('GEN-201', 2, 14),

	-- ('MIC-101', 1, 15),
	-- ('MIC-401', 4, 15),

	-- ('SUR-101', 1, 16),
	-- ('SUR-501', 5, 16),

	-- ('THE-101', 1, 17),
	-- ('THE-301', 3, 17),

	-- ('ANA-101', 1, 18),
	-- ('ANA-201', 2, 18),

	-- ('DEN-101', 1, 19),
	-- ('DEN-401', 4, 19),

	-- ('ORT-101', 1, 20),
	-- ('ORT-301', 3, 20),

	-- ('PHA-101', 1, 21),
	-- ('PHA-201', 2, 21),

	-- ('CLP-101', 1, 22),
	-- ('CLP-301', 3, 22),

	-- ('ECO-101', 1, 23),
	-- ('ECO-201', 2, 23),
	-- ('ECO-301', 3, 23),

	-- ('MICR-101', 1, 24),
	-- ('MICR-401', 4, 24),

	-- ('BNK-101', 1, 25),
	-- ('BNK-201', 2, 25),

	-- ('ACC-101', 1, 26),
	-- ('ACC-301', 3, 26),

	-- ('MNG-101', 1, 27),
	-- ('MNG-201', 2, 27),

	-- ('HR-101', 1, 28),
	-- ('HR-401', 4, 28),

	-- ('MKT-101', 1, 29),
	-- ('MKT-201', 2, 29),

	-- ('PR-101', 1, 30),
	-- ('PR-301', 3, 30),

	-- ('DIP-101', 1, 31),
	-- ('DIP-501', 5, 31),

	-- ('INT-101', 1, 32),
	-- ('INT-301', 3, 32),

	-- ('LAW-101', 1, 33),
	-- ('LAW-201', 2, 33),
	-- ('LAW-401', 4, 33),

	-- ('CIV-101', 1, 34),
	-- ('CIV-301', 3, 34),

	-- ('JRN-101', 1, 35),
	-- ('JRN-201', 2, 35),

	-- ('MED-101', 1, 36),
	-- ('MED-401', 4, 36),

	-- ('UKR-101', 1, 37),
	-- ('UKR-301', 3, 37),

	-- ('LIT-101', 1, 38),
	-- ('LIT-201', 2, 38),

	-- ('ENG-101', 1, 39),
	-- ('ENG-201', 2, 39),
	-- ('ENG-301', 3, 39),

	-- ('GER-101', 1, 40),
	-- ('GER-401', 4, 40),

	-- ('HIS-101', 1, 41),
	-- ('HIS-201', 2, 41),

	-- ('WRD-101', 1, 42),
	-- ('WRD-301', 3, 42),

	-- ('PHI-101', 1, 43),
	-- ('PHI-201', 2, 43),

	-- ('ETH-101', 1, 44),
	-- ('ETH-401', 4, 44),

	-- ('SOC-101', 1, 45),
	-- ('SOC-201', 2, 45),

	-- ('RES-101', 1, 46),
	-- ('RES-301', 3, 46),

	-- ('PSY-101', 1, 47),
	-- ('PSY-201', 2, 47),
	-- ('PSY-501', 5, 47),

	-- ('PPS-101', 1, 48),
	-- ('PPS-301', 3, 48),

	-- ('ARC-101', 1, 49),
	-- ('ARC-401', 4, 49),

	-- ('URB-101', 1, 50),
	-- ('URB-301', 3, 50),

	-- ('CON-101', 1, 51),
	-- ('CON-201', 2, 51),

	-- ('MEC-101', 1, 52),
	-- ('MEC-401', 4, 52),

	-- ('ENE-101', 1, 53),
	-- ('ENE-301', 3, 53),

	-- ('ELC-101', 1, 54),
	-- ('ELC-201', 2, 54),

	-- ('MCH-101', 1, 55),
	-- ('MCH-301', 3, 55),

	-- ('AUT-101', 1, 56),
	-- ('AUT-401', 4, 56),

	-- ('AGR-101', 1, 57),
	-- ('AGR-201', 2, 57),

	-- ('AGR-301', 3, 58),
	-- ('VET-101', 1, 59),

	-- ('VET-201', 2, 60),
	-- ('VET-301', 3, 60),

	-- ('DSN-101', 1, 61),
	-- ('DSN-201', 2, 61),

	-- ('IND-101', 1, 62),
	-- ('IND-401', 4, 62);


-- ¾ ГРУПИ та КУРАТОРИ (GROUPS_CURATORS)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор групи та куратора.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Ідентифікатор куратора (CuratorId). Куратор.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
-- ■ Ідентифікатор групи (GroupId). Група.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
	-- CREATE TABLE GROUPS_CURATORS (

	-- ID SERIAL PRIMARY KEY,

	-- CURATOR_ID INT NOT NULL,

	-- GROUP_ID INT NOT NULL,

	-- FOREIGN KEY (CURATOR_ID)
	-- 	REFERENCES CURATORS(ID),

	-- FOREIGN KEY (GROUP_ID)
	-- 	REFERENCES GROUPS(ID)
	-- )

	-- INSERT INTO GROUPS_CURATORS (CURATOR_ID, GROUP_ID)
	-- VALUES
	-- 	(1, 1),
	-- 	(1, 2),
	-- 	(1, 3),

	-- 	(2, 4),
	-- 	(2, 5),
	-- 	(2, 6),

	-- 	(3, 7),
	-- 	(3, 8),
	-- 	(3, 9),

	-- 	(4, 10),
	-- 	(4, 11),
	-- 	(4, 12),

	-- 	(5, 13),
	-- 	(5, 14),
	-- 	(5, 15),

	-- 	(6, 16),
	-- 	(6, 17),
	-- 	(6, 18),

	-- 	(7, 19),
	-- 	(7, 20),
	-- 	(7, 21),

	-- 	(8, 22),
	-- 	(8, 23),
	-- 	(8, 24),

	-- 	(9, 25),
	-- 	(9, 26),
	-- 	(9, 27),

	-- 	(10, 28),
	-- 	(10, 29),
	-- 	(10, 30),

	-- 	(11, 31),
	-- 	(11, 32),
	-- 	(11, 33),

	-- 	(12, 34),
	-- 	(12, 35),
	-- 	(12, 36),

	-- 	(13, 37),
	-- 	(13, 38),
	-- 	(13, 39),

	-- 	(14, 40),
	-- 	(14, 41),
	-- 	(14, 42),

	-- 	(15, 43),
	-- 	(15, 44),
	-- 	(15, 45),

	-- 	(16, 46),
	-- 	(16, 47),
	-- 	(16, 48),

	-- 	(17, 49),
	-- 	(17, 50),
	-- 	(17, 51),

	-- 	(18, 52),
	-- 	(18, 53),
	-- 	(18, 54),

	-- 	(19, 55),
	-- 	(19, 56),
	-- 	(19, 57),

	-- 	(20, 58),
	-- 	(20, 59),
	-- 	(20, 60),

	-- 	(21, 61),
	-- 	(21, 62),
	-- 	(21, 63),

	-- 	(22, 64),
	-- 	(22, 65),
	-- 	(22, 66),

	-- 	(23, 67),
	-- 	(23, 68),
	-- 	(23, 69),

	-- 	(24, 70),
	-- 	(24, 71),
	-- 	(24, 72),

	-- 	(25, 73),
	-- 	(25, 74),
	-- 	(25, 75),

	-- 	(26, 76),
	-- 	(26, 77),
	-- 	(26, 78),

	-- 	(27, 79),
	-- 	(27, 80),
	-- 	(27, 81),

	-- 	(28, 82),
	-- 	(28, 83),
	-- 	(28, 84),

	-- 	(29, 85),
	-- 	(29, 86),
	-- 	(29, 87),

	-- 	(30, 88),
	-- 	(30, 89),
	-- 	(30, 90),

	-- 	(1, 91),
	-- 	(2, 92),
	-- 	(3, 93),
	-- 	(4, 94),
	-- 	(5, 95),

	-- 	(6, 96),
	-- 	(7, 97),
	-- 	(8, 98),
	-- 	(9, 99),
	-- 	(10, 100);

-- ¾ ГРУПИ та ЛЕКЦІЇ (GROUPS_LECTURES)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор групи та лекції.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Ідентифікатор групи (GroupId). Група.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
-- ■ Ідентифікатор лекції (LectureId). Лекція.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
	-- CREATE TABLE GROUPS_LECTURES (

	-- ID SERIAL PRIMARY KEY,

	-- GROUP_ID INT NOT NULL,

	-- LECTURE_ID INT NOT NULL,

	-- FOREIGN KEY (GROUP_ID)
	-- 	REFERENCES GROUPS(ID),

	-- FOREIGN KEY (LECTURE_ID)
	-- 	REFERENCES LECTURES(ID)
	-- )

	-- INSERT INTO GROUPS_LECTURES (GROUP_ID, LECTURE_ID)
	-- VALUES
	-- 	(1, 1),
	-- 	(1, 2),
	-- 	(1, 3),
	-- 	(1, 4),

	-- 	(2, 1),
	-- 	(2, 2),
	-- 	(2, 5),
	-- 	(2, 6),

	-- 	(3, 3),
	-- 	(3, 4),
	-- 	(3, 7),
	-- 	(3, 8),

	-- 	(4, 5),
	-- 	(4, 6),
	-- 	(4, 9),
	-- 	(4, 10),

	-- 	(5, 7),
	-- 	(5, 8),
	-- 	(5, 11),
	-- 	(5, 12),

	-- 	(6, 9),
	-- 	(6, 10),
	-- 	(6, 13),
	-- 	(6, 14),

	-- 	(7, 11),
	-- 	(7, 12),
	-- 	(7, 15),
	-- 	(7, 16),

	-- 	(8, 13),
	-- 	(8, 14),
	-- 	(8, 17),
	-- 	(8, 18),

	-- 	(9, 15),
	-- 	(9, 16),
	-- 	(9, 19),
	-- 	(9, 20),

	-- 	(10, 17),
	-- 	(10, 18),
	-- 	(10, 21),
	-- 	(10, 22),

	-- 	(11, 19),
	-- 	(11, 20),
	-- 	(11, 23),
	-- 	(11, 24),

	-- 	(12, 21),
	-- 	(12, 22),
	-- 	(12, 25),
	-- 	(12, 26),

	-- 	(13, 23),
	-- 	(13, 24),
	-- 	(13, 27),
	-- 	(13, 28),

	-- 	(14, 25),
	-- 	(14, 26),
	-- 	(14, 29),
	-- 	(14, 30),

	-- 	(15, 27),
	-- 	(15, 28),
	-- 	(15, 31),
	-- 	(15, 32),

	-- 	(16, 29),
	-- 	(16, 30),
	-- 	(16, 33),
	-- 	(16, 34),

	-- 	(17, 31),
	-- 	(17, 32),
	-- 	(17, 35),
	-- 	(17, 36),

	-- 	(18, 33),
	-- 	(18, 34),
	-- 	(18, 37),
	-- 	(18, 38),

	-- 	(19, 35),
	-- 	(19, 36),
	-- 	(19, 39),
	-- 	(19, 40),

	-- 	(20, 37),
	-- 	(20, 38),
	-- 	(20, 41),
	-- 	(20, 42),

	-- 	(21, 39),
	-- 	(21, 40),
	-- 	(21, 43),
	-- 	(21, 44),

	-- 	(22, 41),
	-- 	(22, 42),
	-- 	(22, 45),
	-- 	(22, 46),

	-- 	(23, 43),
	-- 	(23, 44),
	-- 	(23, 47),
	-- 	(23, 48),

	-- 	(24, 45),
	-- 	(24, 46),
	-- 	(24, 49),
	-- 	(24, 50),

	-- 	(25, 47),
	-- 	(25, 48),
	-- 	(25, 51),
	-- 	(25, 52),

	-- 	(26, 49),
	-- 	(26, 50),
	-- 	(26, 53),
	-- 	(26, 54),

	-- 	(27, 51),
	-- 	(27, 52),
	-- 	(27, 55),
	-- 	(27, 56),

	-- 	(28, 53),
	-- 	(28, 54),
	-- 	(28, 57),
	-- 	(28, 58),

	-- 	(29, 55),
	-- 	(29, 56),
	-- 	(29, 59),
	-- 	(29, 60),

	-- 	(30, 57),
	-- 	(30, 58),
	-- 	(30, 61),
	-- 	(30, 62),

	-- 	(31, 59),
	-- 	(31, 60),
	-- 	(31, 63),
	-- 	(31, 64),

	-- 	(32, 61),
	-- 	(32, 62),
	-- 	(32, 65),
	-- 	(32, 66),

	-- 	(33, 63),
	-- 	(33, 64),
	-- 	(33, 67),
	-- 	(33, 68),

	-- 	(34, 65),
	-- 	(34, 66),
	-- 	(34, 69),
	-- 	(34, 70),

	-- 	(35, 67),
	-- 	(35, 68),
	-- 	(35, 71),
	-- 	(35, 72),

	-- 	(36, 69),
	-- 	(36, 70),
	-- 	(36, 73),
	-- 	(36, 74),

	-- 	(37, 71),
	-- 	(37, 72),
	-- 	(37, 75),
	-- 	(37, 76),

	-- 	(38, 73),
	-- 	(38, 74),
	-- 	(38, 77),
	-- 	(38, 78),

	-- 	(39, 75),
	-- 	(39, 76),
	-- 	(39, 79),
	-- 	(39, 80),

	-- 	(40, 77),
	-- 	(40, 78),
	-- 	(40, 81),
	-- 	(40, 82),

	-- 	(41, 79),
	-- 	(41, 80),
	-- 	(41, 83),
	-- 	(41, 84),

	-- 	(42, 81),
	-- 	(42, 82),
	-- 	(42, 85),
	-- 	(42, 86),

	-- 	(43, 83),
	-- 	(43, 84),
	-- 	(43, 87),
	-- 	(43, 88),

	-- 	(44, 85),
	-- 	(44, 86),
	-- 	(44, 89),
	-- 	(44, 90),

	-- 	(45, 1),
	-- 	(45, 10),
	-- 	(45, 20),

	-- 	(46, 2),
	-- 	(46, 11),
	-- 	(46, 21),

	-- 	(47, 3),
	-- 	(47, 12),
	-- 	(47, 22),

	-- 	(48, 4),
	-- 	(48, 13),
	-- 	(48, 23),

	-- 	(49, 5),
	-- 	(49, 14),
	-- 	(49, 24),

	-- 	(50, 6),
	-- 	(50, 15),
	-- 	(50, 25),

	-- 	(51, 7),
	-- 	(51, 16),
	-- 	(51, 26),

	-- 	(52, 8),
	-- 	(52, 17),
	-- 	(52, 27),

	-- 	(53, 9),
	-- 	(53, 18),
	-- 	(53, 28),

	-- 	(54, 10),
	-- 	(54, 19),
	-- 	(54, 29),

	-- 	(55, 11),
	-- 	(55, 20),
	-- 	(55, 30),

	-- 	(56, 12),
	-- 	(56, 21),
	-- 	(56, 31),

	-- 	(57, 13),
	-- 	(57, 22),
	-- 	(57, 32),

	-- 	(58, 14),
	-- 	(58, 23),
	-- 	(58, 33),

	-- 	(59, 15),
	-- 	(59, 24),
	-- 	(59, 34),

	-- 	(60, 16),
	-- 	(60, 25),
	-- 	(60, 35);

-- ¾ ЛЕКЦІЇ (LECTURES)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор лекції.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Аудиторія (LectureRoom). Аудиторія, в якій проходить лекція.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ■ Ідентифікатор предмета (SubjectId). Предмет, з якого читається лекція.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
-- ■ Ідентифікатор викладача (TeacherId). Викладач, який веде лекцію.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
	-- CREATE TABLE LECTURES (

	-- ID SERIAL PRIMARY KEY,

	-- LECTURE_ROOM VARCHAR(100) NOT NULL
	-- 	CHECK (LECTURE_ROOM <> ''),

	-- SUBJECT_ID INT NOT NULL,

	-- TEACHER_ID INT NOT NULL,

	-- FOREIGN KEY (SUBJECT_ID)
	-- 	REFERENCES SUBJECTS(ID),

	-- FOREIGN KEY (TEACHER_ID)
	-- 	REFERENCES TEACHERS(ID)
	-- )

	-- INSERT INTO LECTURES (LECTURE_ROOM, SUBJECT_ID, TEACHER_ID)
	-- VALUES
	-- 	('A-101', 1, 1),
	-- 	('A-102', 2, 2),
	-- 	('A-103', 3, 3),
	-- 	('A-104', 4, 4),
	-- 	('A-105', 5, 5),

	-- 	('B-101', 6, 6),
	-- 	('B-102', 7, 7),
	-- 	('B-103', 8, 8),
	-- 	('B-104', 9, 9),
	-- 	('B-105', 10, 10),

	-- 	('C-101', 11, 11),
	-- 	('C-102', 12, 12),
	-- 	('C-103', 13, 13),
	-- 	('C-104', 14, 14),
	-- 	('C-105', 15, 15),

	-- 	('D-101', 16, 16),
	-- 	('D-102', 17, 17),
	-- 	('D-103', 18, 18),
	-- 	('D-104', 19, 19),
	-- 	('D-105', 20, 20),

	-- 	('E-101', 21, 21),
	-- 	('E-102', 22, 22),
	-- 	('E-103', 23, 23),
	-- 	('E-104', 24, 24),
	-- 	('E-105', 25, 25),

	-- 	('F-101', 26, 26),
	-- 	('F-102', 27, 27),
	-- 	('F-103', 28, 28),
	-- 	('F-104', 29, 29),
	-- 	('F-105', 30, 30),

	-- 	('G-101', 31, 31),
	-- 	('G-102', 32, 32),
	-- 	('G-103', 33, 33),
	-- 	('G-104', 34, 34),
	-- 	('G-105', 35, 35),

	-- 	('H-101', 36, 36),
	-- 	('H-102', 37, 37),
	-- 	('H-103', 38, 38),
	-- 	('H-104', 39, 39),
	-- 	('H-105', 40, 40),

	-- 	('I-101', 41, 41),
	-- 	('I-102', 42, 42),
	-- 	('I-103', 43, 43),
	-- 	('I-104', 44, 44),
	-- 	('I-105', 45, 45),

	-- 	('J-101', 46, 46),
	-- 	('J-102', 47, 47),
	-- 	('J-103', 48, 48),
	-- 	('J-104', 49, 49),
	-- 	('J-105', 50, 50),

	-- 	('K-101', 51, 51),
	-- 	('K-102', 52, 52),
	-- 	('K-103', 53, 53),
	-- 	('K-104', 54, 54),
	-- 	('K-105', 55, 55),

	-- 	('L-101', 56, 56),
	-- 	('L-102', 57, 57),
	-- 	('L-103', 58, 58),
	-- 	('L-104', 59, 59),
	-- 	('L-105', 60, 60),

	-- 	('M-101', 61, 61),
	-- 	('M-102', 62, 62),
	-- 	('M-103', 63, 63),
	-- 	('M-104', 64, 64),
	-- 	('M-105', 65, 65),

	-- 	('N-101', 66, 66),
	-- 	('N-102', 67, 67),
	-- 	('N-103', 68, 68),
	-- 	('N-104', 69, 69),
	-- 	('N-105', 70, 70),

	-- 	('A-201', 1, 11),
	-- 	('A-202', 2, 12),
	-- 	('A-203', 3, 13),
	-- 	('A-204', 4, 14),
	-- 	('A-205', 5, 15),

	-- 	('B-201', 6, 16),
	-- 	('B-202', 7, 17),
	-- 	('B-203', 8, 18),
	-- 	('B-204', 9, 19),
	-- 	('B-205', 10, 20),

	-- 	('C-201', 11, 21),
	-- 	('C-202', 12, 22),
	-- 	('C-203', 13, 23),
	-- 	('C-204', 14, 24),
	-- 	('C-205', 15, 25),

	-- 	('D-201', 16, 26),
	-- 	('D-202', 17, 27),
	-- 	('D-203', 18, 28),
	-- 	('D-204', 19, 29),
	-- 	('D-205', 20, 30);

-- ПРЕДМЕТ (SUBJECTS)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор предмета.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Назва (Name). Назва предмета.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.
	-- CREATE TABLE SUBJECTS (

	-- ID SERIAL PRIMARY KEY,
	-- NAME VARCHAR(100) NOT NULL
	-- 	CHECK (NAME <> '')
	-- 	UNIQUE
	-- )

	-- INSERT INTO SUBJECTS (NAME)
	-- VALUES
	-- 	('Програмування'),
	-- 	('Об''єктно-орієнтоване програмування'),
	-- 	('Алгоритми та структури даних'),
	-- 	('Бази даних'),
	-- 	('SQL та PostgreSQL'),
	-- 	('Data Science'),
	-- 	('Машинне навчання'),
	-- 	('Штучний інтелект'),
	-- 	('Комп''ютерні мережі'),
	-- 	('Кібербезпека'),
	-- 	('Операційні системи'),
	-- 	('Веброзробка'),
	-- 	('Frontend розробка'),
	-- 	('Backend розробка'),
	-- 	('Python'),
	-- 	('Java'),
	-- 	('C++'),
	-- 	('JavaScript'),
	-- 	('Математичний аналіз'),
	-- 	('Лінійна алгебра'),
	-- 	('Дискретна математика'),
	-- 	('Теорія ймовірностей'),
	-- 	('Фізика'),
	-- 	('Ядерна фізика'),
	-- 	('Хімія'),
	-- 	('Органічна хімія'),
	-- 	('Біологія'),
	-- 	('Генетика'),
	-- 	('Мікробіологія'),
	-- 	('Анатомія людини'),
	-- 	('Фармакологія'),
	-- 	('Хірургія'),
	-- 	('Терапія'),
	-- 	('Стоматологія'),
	-- 	('Економіка'),
	-- 	('Макроекономіка'),
	-- 	('Мікроекономіка'),
	-- 	('Бухгалтерський облік'),
	-- 	('Фінанси'),
	-- 	('Банківська справа'),
	-- 	('Менеджмент'),
	-- 	('Маркетинг'),
	-- 	('Реклама та PR'),
	-- 	('Міжнародні відносини'),
	-- 	('Правознавство'),
	-- 	('Кримінальне право'),
	-- 	('Цивільне право'),
	-- 	('Журналістика'),
	-- 	('Медіакомунікації'),
	-- 	('Українська мова'),
	-- 	('Українська література'),
	-- 	('Англійська мова'),
	-- 	('Німецька мова'),
	-- 	('Історія України'),
	-- 	('Всесвітня історія'),
	-- 	('Філософія'),
	-- 	('Соціологія'),
	-- 	('Психологія'),
	-- 	('Архітектура'),
	-- 	('Будівництво'),
	-- 	('Інженерна механіка'),
	-- 	('Електротехніка'),
	-- 	('Електроенергетика'),
	-- 	('Машинобудування'),
	-- 	('Автоматизація виробництва'),
	-- 	('Агрономія'),
	-- 	('Ветеринарія'),
	-- 	('Графічний дизайн'),
	-- 	('Промисловий дизайн'),
	-- 	('Урбаністика');

-- ¾ ВИКЛАДАЧІ(TEACHERS)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор викладача.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Ім’я (Name). Ім’я викладача.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ■ Ставка (Salary). Ставка викладача.
-- ▷ Тип даних — DECIMAL(10, 2).
-- ▷ Не містить null-значення.
-- ▷ Не може бути меншою або дорівнювати 0.
-- ■ Прізвище (Surname). Прізвище викладача.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожнє.
	-- CREATE TABLE TEACHERS (

	-- ID SERIAL PRIMARY KEY,

	-- NAME VARCHAR(100) NOT NULL
	-- 	CHECK (NAME <> ''),

	-- SALARY DECIMAL(10, 2) NOT NULL
	-- 	CHECK (SALARY > 0),

	-- SURNAME VARCHAR(100) NOT NULL
	-- 	CHECK (SURNAME <> '')
	-- )

	-- INSERT INTO TEACHERS (NAME, SALARY, SURNAME)
	-- VALUES
	-- 	('Іван', 32000.00, 'Петренко'),
	-- 	('Олександр', 35000.00, 'Шевченко'),
	-- 	('Максим', 28000.00, 'Бондаренко'),
	-- 	('Андрій', 41000.00, 'Коваленко'),
	-- 	('Дмитро', 39000.00, 'Ткаченко'),
	-- 	('Володимир', 45000.00, 'Мельник'),
	-- 	('Сергій', 37000.00, 'Кравченко'),
	-- 	('Юрій', 34000.00, 'Олійник'),
	-- 	('Віталій', 30000.00, 'Савченко'),
	-- 	('Микола', 42000.00, 'Романенко'),

	-- 	('Олег', 36000.00, 'Лисенко'),
	-- 	('Богдан', 33000.00, 'Гриценко'),
	-- 	('Євген', 47000.00, 'Марченко'),
	-- 	('Роман', 29000.00, 'Поліщук'),
	-- 	('Тарас', 31500.00, 'Данилюк'),
	-- 	('Павло', 38500.00, 'Іщенко'),
	-- 	('Артем', 35500.00, 'Сидоренко'),
	-- 	('Руслан', 32500.00, 'Чумак'),
	-- 	('Василь', 44000.00, 'Яремчук'),
	-- 	('Степан', 29500.00, 'Захаренко'),

	-- 	('Анна', 31000.00, 'Коваль'),
	-- 	('Марія', 36500.00, 'Білик'),
	-- 	('Олена', 43000.00, 'Назаренко'),
	-- 	('Ірина', 34500.00, 'Левченко'),
	-- 	('Катерина', 38000.00, 'Паламарчук'),
	-- 	('Наталія', 40000.00, 'Федоренко'),
	-- 	('Юлія', 33500.00, 'Мороз'),
	-- 	('Тетяна', 36000.00, 'Кушнір'),
	-- 	('Світлана', 31500.00, 'Дорошенко'),
	-- 	('Вікторія', 39000.00, 'Приходько'),

	-- 	('Оксана', 37000.00, 'Гаврилюк'),
	-- 	('Людмила', 34500.00, 'Мазур'),
	-- 	('Алла', 41000.00, 'Семенюк'),
	-- 	('Дарина', 30000.00, 'Тимошенко'),
	-- 	('Софія', 35500.00, 'Клименко'),
	-- 	('Аліна', 36500.00, 'Бабенко'),
	-- 	('Христина', 39500.00, 'Павленко'),
	-- 	('Вероніка', 42000.00, 'Руденко'),
	-- 	('Уляна', 31000.00, 'Шаповал'),
	-- 	('Надія', 33000.00, 'Литвин'),

	-- 	('Валерій', 48000.00, 'Мельничук'),
	-- 	('Григорій', 36500.00, 'Безкоровайний'),
	-- 	('Леонід', 34000.00, 'Стеценко'),
	-- 	('Ярослав', 45000.00, 'Демченко'),
	-- 	('Вадим', 29500.00, 'Пономаренко'),
	-- 	('Кирило', 37000.00, 'Терещенко'),
	-- 	('Ростислав', 38500.00, 'Хоменко'),
	-- 	('Захар', 41000.00, 'Самойленко'),
	-- 	('Денис', 36000.00, 'Яценко'),
	-- 	('Марк', 43000.00, 'Буряк'),

	-- 	('Едуард', 34500.00, 'Синиця'),
	-- 	('Ігор', 32000.00, 'Гончар'),
	-- 	('В’ячеслав', 47000.00, 'Карпенко'),
	-- 	('Анатолій', 35500.00, 'Жук'),
	-- 	('Станіслав', 37500.00, 'Мироненко'),
	-- 	('Віктор', 39000.00, 'Троценко'),
	-- 	('Петро', 31000.00, 'Костенко'),
	-- 	('Михайло', 44000.00, 'Гордієнко'),
	-- 	('Арсен', 35000.00, 'Дяченко'),
	-- 	('Тимур', 36500.00, 'Остапенко'),

	-- 	('Любов', 33500.00, 'Савчук'),
	-- 	('Зоряна', 36000.00, 'Нечипоренко'),
	-- 	('Лілія', 41500.00, 'Власенко'),
	-- 	('Інна', 34500.00, 'Кириленко'),
	-- 	('Поліна', 30000.00, 'Мельниченко'),
	-- 	('Єлизавета', 32500.00, 'Богдан'),
	-- 	('Ангеліна', 39000.00, 'Куценко'),
	-- 	('Карина', 35500.00, 'Рибак'),
	-- 	('Маргарита', 37000.00, 'Гладка'),
	-- 	('Соломія', 40500.00, 'Черненко');

---ЗАВДАННЯ---
-- 1. Виведіть усі можливі пари рядків викладачів і груп.
	SELECT TEACH.NAME||' '||TEACH.SURNAME AS TEACHER_NAME,
		GR.NAME AS GROUP_NAME
	FROM TEACHERS TEACH CROSS JOIN GROUPS GR

-- 2. Виведіть назви факультетів, фонд фінансування кафедр яких перевищує фонд фінансування факультету.
	SELECT FAC.NAME, FAC.FINANCING, SUM(DEP.FINANCING)
	FROM FACULTIES FAC JOIN DEPARTMENTS DEP ON FAC.ID = DEP.FACULTY_ID
	GROUP BY FAC.ID, FAC.NAME, FAC.FINANCING
	HAVING SUM(DEP.FINANCING) > FAC.FINANCING

-- 3. Виведіть прізвища кураторів груп і назви груп, які вони курирують.
	SELECT CUR.NAME||' '||CUR.SURNAME AS FULL_NAME_CUR, GR.NAME
	FROM CURATORS CUR JOIN GROUPS_CURATORS GRCU ON CUR.ID = GRCU.CURATOR_ID
		JOIN GROUPS GR ON GR.ID = GRCU.GROUP_ID

-- 4. Виведіть імена та прізвища викладачів, які читають лекції у групі «P107».
	SELECT
		TCH.NAME||' '||TCH.SURNAME AS FULL_NAME_TEACH,
		GR.NAME
	FROM
		TEACHERS TCH JOIN LECTURES LEC ON TCH.ID = LEC.TEACHER_ID
		JOIN GROUPS_LECTURES GRLEC ON GRLEC.LECTURE_ID = LEC.ID
		JOIN GROUPS GR ON GR.ID = GRLEC.GROUP_ID
	WHERE GR.NAME = 'AI-101'

-- 5. Виведіть прізвища викладачів і назви факультетів, на яких вони читають лекції.
	SELECT
		TCH.SURNAME, FAC.NAME
	FROM
		TEACHERS TCH JOIN FACULTIES FAC ON TCH.ID = FAC.ID
		JOIN LECTURES LEC ON TCH.ID = LEC.TEACHER_ID

-- 6. Виведіть назви кафедр і назви груп, які до них належать.
	SELECT
		DEP.NAME AS DEP_NAME, GR.NAME AS GROUPS_NAME
	FROM
		DEPARTMENTS DEP JOIN GROUPS GR ON DEP.ID = GR.DEPARTMENT_ID

-- 7. Виведіть назви предметів, які викладає викладач «Samantha Adams».
	SELECT
		SUB.NAME, TCHR.NAME||' '||TCHR.SURNAME AS FULL_NAME_TEACHER
	FROM
		SUBJECTS SUB JOIN LECTURES LEC ON SUB.ID = LEC.SUBJECT_ID
		JOIN TEACHERS TCHR ON TCHR.ID = LEC.TEACHER_ID
	WHERE TCHR.NAME = 'Володимир' AND TCHR.SURNAME = 'Мельник'

-- 8. Виведіть назви кафедр, на яких викладається дисципліна «Database Theory».
	SELECT
		DEP.NAME AS NAME_DEPARTMENT, SUB.NAME AS SUBJECT
	FROM
		DEPARTMENTS DEP JOIN GROUPS GR ON DEP.ID = GR.DEPARTMENT_ID
		JOIN GROUPS_LECTURES GL ON GL.GROUP_ID = GR.ID
		JOIN LECTURES LEC ON LEC.ID = GL.LECTURE_ID
		JOIN SUBJECTS SUB ON SUB.ID = LEC.SUBJECT_ID
	WHERE SUB.NAME = 'SQL та PostgreSQL'

-- 9. Виведіть назви груп, що належать до факультету «Computer Science».
	SELECT
		GR.NAME AS GROUP_NAME
	FROM
		GROUPS GR JOIN DEPARTMENTS DEP ON GR.DEPARTMENT_ID = DEP.ID
		JOIN FACULTIES FAC ON FAC.ID = DEP.FACULTY_ID
	WHERE FAC.NAME = 'Факультет кібербезпеки'

-- 10. Виведіть назви груп 5-го курсу, а також назви факультетів, до яких вони належать.
	SELECT GR.NAME AS NAME_GROUP, GR.YEAR, FAC.NAME
	FROM
		GROUPS GR JOIN DEPARTMENTS DEP ON GR.DEPARTMENT_ID = DEP.ID
		JOIN FACULTIES FAC ON FAC.ID = DEP.FACULTY_ID
	WHERE GR.YEAR = '5'

-- 11. Виведіть повні імена викладачів і лекції, які вони читають (назви предметів та груп).
	-- Зробіть відбір по тим лекціям, які проходять в аудиторії «B-103».
	SELECT
		TCHR.NAME||' '||TCHR.SURNAME AS FULL_NAME_TEACHERS,
		SUB.NAME AS SUBJECT_NAME,
		GR.NAME AS GROUP_NAME
	FROM
		TEACHERS TCHR JOIN LECTURES LEC ON TCHR.ID = LEC.TEACHER_ID
		JOIN SUBJECTS SUB ON SUB.ID = LEC.SUBJECT_ID
		JOIN GROUPS_LECTURES GL ON GL.LECTURE_ID = LEC.ID
		JOIN GROUPS GR ON GR.ID = GL.GROUP_ID
	WHERE LEC.LECTURE_ROOM = 'B-103'
