# Модуль 10: Системи контролю версій
# Тема: Системи контролю версій. Частина 1

# Завдання 1
# Встановіть і налаштуйте на своєму локальному комп'ютері Git.

# Завдання 2
# Створіть папку з двома підпапками. У кожну папку додайте кілька файлів.

# Завдання 3
# Створіть репозиторій у головній папці.

# Завдання 4
# Додайте вміст двох підпапок в індекс репозиторія за допомогою команди: git add.

# Завдання 5
# Створіть commit на підставі підпапок, доданих в індекс. Використайте команду: git commit.

# Завдання 6
# Змініть вміст одного з файлів у папці та створіть commit з новими даними.

# Завдання 7
# Створіть нову підпапку, наповніть її даними. Після наповнення створіть commit із вмістом нової папки.


# Завдання 8
# Внесіть зміни у вміст файлу в новій папці, збережіть зміни (не створюйте новий commit).
# Скасуйте зміни в локальній копії файлу за допомогою команди: git checkout.

# Завдання 9
# Внесіть зміни у вміст файлу в новій папці, додайте зміни в індекс (не створюйте новий commit).
# Скасуйте зміни в індексі за допомогою команди: git reset.

# Завдання 10
# Внесіть зміни у вміст файлу в новій папці, додайте зміни в індекс, створіть новий commit.
# Скасуйте зміни в останньому commit шляхом створення нового commit за допомогою команди: git revert.

# Завдання 11
# Видаліть кілька останніх commit. Використайте команду: git reset з опцією --hard.

# Завдання 12
# Внесіть зміни в останній commit, не створюючи нового. Використайте: git commit з ключем --amend.

# Завдання 13
# Надішліть наявний репозиторій до сайту GitHub
